
//Вывести квадрат числа 

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

int square = 0;

square = number * number;

Console.WriteLine($"Квадрат числа = {square}");



